app/Controllers/Home.php

SELECT *
FROM `candidato`
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `candidato`
---
            // Admin: Dados globais do sistema (pode listar tudo de tudo)
            $data['total_vagas'] = count($vagasM->findAll());
            $candidatoM = new CandidatoModel();
            $data['total_candidatos'] = count($candidatoM->findAll());