app/Models/CandidatoModel.php

    public function verificarLogin($email, $senha)
    {
        return $this->where('email', $email)
                    ->where('senha', $senha)
                    ->first(); // Retorna a primeira linha encontrada ou null se não existir
---
SELECT *
FROM `candidato`
WHERE `email` = 'robson5432@gmail'
AND `senha` = '654'
 LIMIT 1