app/Models/EmpresaModel.php

    public function verificarLogin($email, $senha)
    {
        return $this->where('email', $email)
                    ->where('senha', $senha)
                    ->first(); // Retorna os dados da empresa se achar, ou null se não achar
---
SELECT *
FROM `empresa`
WHERE `email` = 'robson5432@gmail'
AND `senha` = '654'
 LIMIT 1