app/Models/InscricaoModel.php

    public function buscarCandidatosPorVaga($id_vaga)
    {
        return $this->select('candidato.nome, candidato.email, candidato.telefone')
                    ->join('candidato', 'candidato.id = candidato_vaga.id_candidato')
                    ->where('candidato_vaga.id_vagas', $id_vaga)
                    ->findAll();
---
SELECT `candidato`.`nome`, `candidato`.`email`, `candidato`.`telefone`
FROM `candidato_vaga`
JOIN `candidato` ON `candidato`.`id` = `candidato_vaga`.`id_candidato`
WHERE `candidato_vaga`.`id_vagas` = '2'