app/Models/vagasModel.php

SELECT `vagas`.*, `empresa`.`nome` as `nome_empresa`
FROM `vagas`
JOIN `empresa` ON `empresa`.`id` = `vagas`.`id_empresa`
---
    public function buscarTodasVagas() {
        return $this->select('vagas.*, empresa.nome as nome_empresa')
                    ->join('empresa', 'empresa.id = vagas.id_empresa')
                    ->findAll();

SELECT *
FROM `vagas`
WHERE `id_empresa` = '2'
---
    public function buscarVagasPorEmpresa($id_empresa) {
        return $this->where('id_empresa', $id_empresa)->findAll();